__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 5)            0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 256)          0                                            
__________________________________________________________________________________________________
equalized_dense_1 (EqualizedDen (None, 5)            30          input_2[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 261)          0           input_1[0][0]                    
                                                                 equalized_dense_1[0][0]          
__________________________________________________________________________________________________
latent_pixel_normalization_1 (L (None, 261)          0           concatenate_1[0][0]              
__________________________________________________________________________________________________
equalized_dense_2 (EqualizedDen (None, 2048)         536576      latent_pixel_normalization_1[0][0
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 4, 4, 128)    0           equalized_dense_2[0][0]          
__________________________________________________________________________________________________
equalized_conv2d_1 (EqualizedCo (None, 4, 4, 128)    147584      reshape_1[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 4, 4, 128)    0           equalized_conv2d_1[0][0]         
__________________________________________________________________________________________________
pixel_normalization_1 (PixelNor (None, 4, 4, 128)    0           leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 8, 8, 128)    0           pixel_normalization_1[0][0]      
__________________________________________________________________________________________________
equalized_conv2d_3 (EqualizedCo (None, 8, 8, 128)    147584      up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 8, 8, 128)    0           equalized_conv2d_3[0][0]         
__________________________________________________________________________________________________
pixel_normalization_2 (PixelNor (None, 8, 8, 128)    0           leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
equalized_conv2d_4 (EqualizedCo (None, 8, 8, 128)    147584      pixel_normalization_2[0][0]      
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 8, 8, 128)    0           equalized_conv2d_4[0][0]         
__________________________________________________________________________________________________
pixel_normalization_3 (PixelNor (None, 8, 8, 128)    0           leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 16, 16, 128)  0           pixel_normalization_3[0][0]      
__________________________________________________________________________________________________
equalized_conv2d_6 (EqualizedCo (None, 16, 16, 128)  147584      up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 16, 16, 128)  0           equalized_conv2d_6[0][0]         
__________________________________________________________________________________________________
pixel_normalization_4 (PixelNor (None, 16, 16, 128)  0           leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
equalized_conv2d_7 (EqualizedCo (None, 16, 16, 128)  147584      pixel_normalization_4[0][0]      
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 16, 16, 128)  0           equalized_conv2d_7[0][0]         
__________________________________________________________________________________________________
pixel_normalization_5 (PixelNor (None, 16, 16, 128)  0           leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 32, 32, 128)  0           pixel_normalization_5[0][0]      
__________________________________________________________________________________________________
equalized_conv2d_9 (EqualizedCo (None, 32, 32, 128)  147584      up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 32, 32, 128)  0           equalized_conv2d_9[0][0]         
__________________________________________________________________________________________________
pixel_normalization_6 (PixelNor (None, 32, 32, 128)  0           leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
equalized_conv2d_10 (EqualizedC (None, 32, 32, 128)  147584      pixel_normalization_6[0][0]      
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 32, 32, 128)  0           equalized_conv2d_10[0][0]        
__________________________________________________________________________________________________
pixel_normalization_7 (PixelNor (None, 32, 32, 128)  0           leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)  (None, 64, 64, 128)  0           pixel_normalization_7[0][0]      
__________________________________________________________________________________________________
equalized_conv2d_12 (EqualizedC (None, 64, 64, 64)   73792       up_sampling2d_4[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 64, 64, 64)   0           equalized_conv2d_12[0][0]        
__________________________________________________________________________________________________
pixel_normalization_8 (PixelNor (None, 64, 64, 64)   0           leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
equalized_conv2d_13 (EqualizedC (None, 64, 64, 64)   36928       pixel_normalization_8[0][0]      
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 64, 64, 64)   0           equalized_conv2d_13[0][0]        
__________________________________________________________________________________________________
pixel_normalization_9 (PixelNor (None, 64, 64, 64)   0           leaky_re_lu_9[0][0]              
__________________________________________________________________________________________________
up_sampling2d_5 (UpSampling2D)  (None, 128, 128, 64) 0           pixel_normalization_9[0][0]      
__________________________________________________________________________________________________
equalized_conv2d_15 (EqualizedC (None, 128, 128, 32) 18464       up_sampling2d_5[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 128, 128, 32) 0           equalized_conv2d_15[0][0]        
__________________________________________________________________________________________________
pixel_normalization_10 (PixelNo (None, 128, 128, 32) 0           leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
equalized_conv2d_16 (EqualizedC (None, 128, 128, 32) 9248        pixel_normalization_10[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 128, 128, 32) 0           equalized_conv2d_16[0][0]        
__________________________________________________________________________________________________
pixel_normalization_11 (PixelNo (None, 128, 128, 32) 0           leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
up_sampling2d_6 (UpSampling2D)  (None, 256, 256, 32) 0           pixel_normalization_11[0][0]     
__________________________________________________________________________________________________
equalized_conv2d_18 (EqualizedC (None, 256, 256, 16) 4624        up_sampling2d_6[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 256, 256, 16) 0           equalized_conv2d_18[0][0]        
__________________________________________________________________________________________________
pixel_normalization_12 (PixelNo (None, 256, 256, 16) 0           leaky_re_lu_12[0][0]             
__________________________________________________________________________________________________
equalized_conv2d_19 (EqualizedC (None, 256, 256, 16) 2320        pixel_normalization_12[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 256, 256, 16) 0           equalized_conv2d_19[0][0]        
__________________________________________________________________________________________________
pixel_normalization_13 (PixelNo (None, 256, 256, 16) 0           leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
equalized_conv2d_20 (EqualizedC (None, 256, 256, 3)  51          pixel_normalization_13[0][0]     
__________________________________________________________________________________________________
equalized_conv2d_17 (EqualizedC (None, 128, 128, 3)  99          pixel_normalization_11[0][0]     
__________________________________________________________________________________________________
equalized_conv2d_14 (EqualizedC (None, 64, 64, 3)    195         pixel_normalization_9[0][0]      
__________________________________________________________________________________________________
equalized_conv2d_11 (EqualizedC (None, 32, 32, 3)    387         pixel_normalization_7[0][0]      
__________________________________________________________________________________________________
equalized_conv2d_8 (EqualizedCo (None, 16, 16, 3)    387         pixel_normalization_5[0][0]      
__________________________________________________________________________________________________
equalized_conv2d_5 (EqualizedCo (None, 8, 8, 3)      387         pixel_normalization_3[0][0]      
__________________________________________________________________________________________________
equalized_conv2d_2 (EqualizedCo (None, 4, 4, 3)      387         pixel_normalization_1[0][0]      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 256, 256, 3)  0           equalized_conv2d_20[0][0]        
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 128, 128, 3)  0           equalized_conv2d_17[0][0]        
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 64, 64, 3)    0           equalized_conv2d_14[0][0]        
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 3)    0           equalized_conv2d_11[0][0]        
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 16, 16, 3)    0           equalized_conv2d_8[0][0]         
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 8, 8, 3)      0           equalized_conv2d_5[0][0]         
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 4, 4, 3)      0           equalized_conv2d_2[0][0]         
==================================================================================================
Total params: 1,716,963
Trainable params: 1,716,963
Non-trainable params: 0
__________________________________________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 256, 256, 3)  0                                            
__________________________________________________________________________________________________
equalized_conv2d_21 (EqualizedC (None, 256, 256, 16) 64          input_3[0][0]                    
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 256, 256, 16) 0           equalized_conv2d_21[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_22 (EqualizedC (None, 256, 256, 16) 2320        leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 256, 256, 16) 0           equalized_conv2d_22[0][0]        
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 128, 128, 16) 0           leaky_re_lu_15[0][0]             
__________________________________________________________________________________________________
input_5 (InputLayer)            (None, 128, 128, 3)  0                                            
__________________________________________________________________________________________________
equalized_conv2d_23 (EqualizedC (None, 128, 128, 32) 4640        average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_24 (EqualizedC (None, 128, 128, 32) 128         input_5[0][0]                    
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 128, 128, 32) 0           equalized_conv2d_23[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 128, 128, 32) 0           equalized_conv2d_24[0][0]        
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 128, 128, 64) 0           leaky_re_lu_16[0][0]             
                                                                 leaky_re_lu_17[0][0]             
__________________________________________________________________________________________________
equalized_conv2d_25 (EqualizedC (None, 128, 128, 64) 36928       concatenate_2[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 128, 128, 64) 0           equalized_conv2d_25[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_26 (EqualizedC (None, 128, 128, 64) 36928       leaky_re_lu_18[0][0]             
__________________________________________________________________________________________________
input_6 (InputLayer)            (None, 64, 64, 3)    0                                            
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 128, 128, 64) 0           equalized_conv2d_26[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_27 (EqualizedC (None, 64, 64, 64)   256         input_6[0][0]                    
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 64, 64, 64)   0           leaky_re_lu_19[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 64, 64, 64)   0           equalized_conv2d_27[0][0]        
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 64, 64, 128)  0           average_pooling2d_2[0][0]        
                                                                 leaky_re_lu_20[0][0]             
__________________________________________________________________________________________________
equalized_conv2d_28 (EqualizedC (None, 64, 64, 128)  147584      concatenate_3[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 64, 64, 128)  0           equalized_conv2d_28[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_29 (EqualizedC (None, 64, 64, 128)  147584      leaky_re_lu_21[0][0]             
__________________________________________________________________________________________________
input_7 (InputLayer)            (None, 32, 32, 3)    0                                            
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (None, 64, 64, 128)  0           equalized_conv2d_29[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_30 (EqualizedC (None, 32, 32, 128)  512         input_7[0][0]                    
__________________________________________________________________________________________________
average_pooling2d_3 (AveragePoo (None, 32, 32, 128)  0           leaky_re_lu_22[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)      (None, 32, 32, 128)  0           equalized_conv2d_30[0][0]        
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 32, 32, 256)  0           average_pooling2d_3[0][0]        
                                                                 leaky_re_lu_23[0][0]             
__________________________________________________________________________________________________
equalized_conv2d_31 (EqualizedC (None, 32, 32, 128)  295040      concatenate_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_24 (LeakyReLU)      (None, 32, 32, 128)  0           equalized_conv2d_31[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_32 (EqualizedC (None, 32, 32, 128)  147584      leaky_re_lu_24[0][0]             
__________________________________________________________________________________________________
input_8 (InputLayer)            (None, 16, 16, 3)    0                                            
__________________________________________________________________________________________________
leaky_re_lu_25 (LeakyReLU)      (None, 32, 32, 128)  0           equalized_conv2d_32[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_33 (EqualizedC (None, 16, 16, 128)  512         input_8[0][0]                    
__________________________________________________________________________________________________
average_pooling2d_4 (AveragePoo (None, 16, 16, 128)  0           leaky_re_lu_25[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_26 (LeakyReLU)      (None, 16, 16, 128)  0           equalized_conv2d_33[0][0]        
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 16, 16, 256)  0           average_pooling2d_4[0][0]        
                                                                 leaky_re_lu_26[0][0]             
__________________________________________________________________________________________________
equalized_conv2d_34 (EqualizedC (None, 16, 16, 128)  295040      concatenate_5[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_27 (LeakyReLU)      (None, 16, 16, 128)  0           equalized_conv2d_34[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_35 (EqualizedC (None, 16, 16, 128)  147584      leaky_re_lu_27[0][0]             
__________________________________________________________________________________________________
input_9 (InputLayer)            (None, 8, 8, 3)      0                                            
__________________________________________________________________________________________________
leaky_re_lu_28 (LeakyReLU)      (None, 16, 16, 128)  0           equalized_conv2d_35[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_36 (EqualizedC (None, 8, 8, 128)    512         input_9[0][0]                    
__________________________________________________________________________________________________
average_pooling2d_5 (AveragePoo (None, 8, 8, 128)    0           leaky_re_lu_28[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_29 (LeakyReLU)      (None, 8, 8, 128)    0           equalized_conv2d_36[0][0]        
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 8, 8, 256)    0           average_pooling2d_5[0][0]        
                                                                 leaky_re_lu_29[0][0]             
__________________________________________________________________________________________________
equalized_conv2d_37 (EqualizedC (None, 8, 8, 128)    295040      concatenate_6[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_30 (LeakyReLU)      (None, 8, 8, 128)    0           equalized_conv2d_37[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_38 (EqualizedC (None, 8, 8, 128)    147584      leaky_re_lu_30[0][0]             
__________________________________________________________________________________________________
input_10 (InputLayer)           (None, 4, 4, 3)      0                                            
__________________________________________________________________________________________________
leaky_re_lu_31 (LeakyReLU)      (None, 8, 8, 128)    0           equalized_conv2d_38[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_39 (EqualizedC (None, 4, 4, 128)    512         input_10[0][0]                   
__________________________________________________________________________________________________
average_pooling2d_6 (AveragePoo (None, 4, 4, 128)    0           leaky_re_lu_31[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_32 (LeakyReLU)      (None, 4, 4, 128)    0           equalized_conv2d_39[0][0]        
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 4, 4, 256)    0           average_pooling2d_6[0][0]        
                                                                 leaky_re_lu_32[0][0]             
__________________________________________________________________________________________________
mini_batch_std_1 (MiniBatchStd) (None, 4, 4, 257)    0           concatenate_7[0][0]              
__________________________________________________________________________________________________
equalized_conv2d_40 (EqualizedC (None, 4, 4, 128)    296192      mini_batch_std_1[0][0]           
__________________________________________________________________________________________________
leaky_re_lu_33 (LeakyReLU)      (None, 4, 4, 128)    0           equalized_conv2d_40[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_41 (EqualizedC (None, 1, 1, 128)    262272      leaky_re_lu_33[0][0]             
__________________________________________________________________________________________________
input_4 (InputLayer)            (None, 5)            0                                            
__________________________________________________________________________________________________
leaky_re_lu_34 (LeakyReLU)      (None, 1, 1, 128)    0           equalized_conv2d_41[0][0]        
__________________________________________________________________________________________________
equalized_dense_4 (EqualizedDen (None, 1)            6           input_4[0][0]                    
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 128)          0           leaky_re_lu_34[0][0]             
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 128)          0           equalized_dense_4[0][0]          
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 128)          0           lambda_1[0][0]                   
                                                                 flatten_1[0][0]                  
__________________________________________________________________________________________________
equalized_dense_3 (EqualizedDen (None, 1)            129         flatten_1[0][0]                  
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 1)            0           multiply_1[0][0]                 
__________________________________________________________________________________________________
add_1 (Add)                     (None, 1)            0           equalized_dense_3[0][0]          
                                                                 lambda_2[0][0]                   
==================================================================================================
Total params: 2,264,951
Trainable params: 2,264,951
Non-trainable params: 0
__________________________________________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_18 (InputLayer)           (None, 256, 256, 3)  0                                            
__________________________________________________________________________________________________
input_19 (InputLayer)           (None, 128, 128, 3)  0                                            
__________________________________________________________________________________________________
input_20 (InputLayer)           (None, 64, 64, 3)    0                                            
__________________________________________________________________________________________________
input_21 (InputLayer)           (None, 32, 32, 3)    0                                            
__________________________________________________________________________________________________
input_22 (InputLayer)           (None, 16, 16, 3)    0                                            
__________________________________________________________________________________________________
input_23 (InputLayer)           (None, 8, 8, 3)      0                                            
__________________________________________________________________________________________________
input_24 (InputLayer)           (None, 4, 4, 3)      0                                            
__________________________________________________________________________________________________
input_25 (InputLayer)           (None, 5)            0                                            
__________________________________________________________________________________________________
input_11 (InputLayer)           (None, 256, 256, 3)  0                                            
__________________________________________________________________________________________________
input_12 (InputLayer)           (None, 128, 128, 3)  0                                            
__________________________________________________________________________________________________
input_13 (InputLayer)           (None, 64, 64, 3)    0                                            
__________________________________________________________________________________________________
input_14 (InputLayer)           (None, 32, 32, 3)    0                                            
__________________________________________________________________________________________________
input_15 (InputLayer)           (None, 16, 16, 3)    0                                            
__________________________________________________________________________________________________
input_16 (InputLayer)           (None, 8, 8, 3)      0                                            
__________________________________________________________________________________________________
input_17 (InputLayer)           (None, 4, 4, 3)      0                                            
__________________________________________________________________________________________________
model_2 (Model)                 (None, 1)            2264951     input_11[0][0]                   
                                                                 input_12[0][0]                   
                                                                 input_13[0][0]                   
                                                                 input_14[0][0]                   
                                                                 input_15[0][0]                   
                                                                 input_16[0][0]                   
                                                                 input_17[0][0]                   
                                                                 input_25[0][0]                   
                                                                 input_18[0][0]                   
                                                                 input_19[0][0]                   
                                                                 input_20[0][0]                   
                                                                 input_21[0][0]                   
                                                                 input_22[0][0]                   
                                                                 input_23[0][0]                   
                                                                 input_24[0][0]                   
                                                                 input_25[0][0]                   
==================================================================================================
Total params: 2,264,951
Trainable params: 2,264,951
Non-trainable params: 0
__________________________________________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_26 (InputLayer)           (None, 256)          0                                            
__________________________________________________________________________________________________
input_27 (InputLayer)           (None, 5)            0                                            
__________________________________________________________________________________________________
model_1 (Model)                 [(None, 256, 256, 3) 1716963     input_26[0][0]                   
                                                                 input_27[0][0]                   
__________________________________________________________________________________________________
network_1 (Network)             (None, 1)            2264951     model_1[1][0]                    
                                                                 model_1[1][1]                    
                                                                 model_1[1][2]                    
                                                                 model_1[1][3]                    
                                                                 model_1[1][4]                    
                                                                 model_1[1][5]                    
                                                                 model_1[1][6]                    
                                                                 input_27[0][0]                   
==================================================================================================
Total params: 3,981,914
Trainable params: 1,716,963
Non-trainable params: 2,264,951
__________________________________________________________________________________________________
