__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 5)            0                                            
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 256)          0                                            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 5)            30          input_2[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 261)          0           input_1[0][0]                    
                                                                 dense_1[0][0]                    
__________________________________________________________________________________________________
latent_pixel_normalization_1 (L (None, 261)          0           concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 256)          67072       latent_pixel_normalization_1[0][0
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 256)          0           dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 256)          65792       leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 256)          0           dense_3[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 256)          65792       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 256)          0                                            
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 256)          0           dense_4[0][0]                    
__________________________________________________________________________________________________
constant_latent_1 (ConstantLate (None, 4, 4, 256)    0           input_3[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 256)          65792       leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 4, 4, 128)    295040      constant_latent_1[0][0]          
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 256)          0           dense_5[0][0]                    
__________________________________________________________________________________________________
noise_layer_1 (NoiseLayer)      (None, 4, 4, 128)    128         conv2d_1[0][0]                   
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 128)          32896       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 128)          32896       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 4, 4, 128)    0           noise_layer_1[0][0]              
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 1, 1, 128)    0           dense_7[0][0]                    
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 1, 1, 128)    0           dense_6[0][0]                    
__________________________________________________________________________________________________
ada_instance_normalization_1 (A (None, 4, 4, 128)    0           leaky_re_lu_5[0][0]              
                                                                 reshape_2[0][0]                  
                                                                 reshape_1[0][0]                  
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 4, 4, 128)    147584      ada_instance_normalization_1[0][0
__________________________________________________________________________________________________
noise_layer_2 (NoiseLayer)      (None, 4, 4, 128)    128         conv2d_2[0][0]                   
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 128)          32896       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 128)          32896       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 4, 4, 128)    0           noise_layer_2[0][0]              
__________________________________________________________________________________________________
reshape_4 (Reshape)             (None, 1, 1, 128)    0           dense_9[0][0]                    
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 1, 1, 128)    0           dense_8[0][0]                    
__________________________________________________________________________________________________
ada_instance_normalization_2 (A (None, 4, 4, 128)    0           leaky_re_lu_6[0][0]              
                                                                 reshape_4[0][0]                  
                                                                 reshape_3[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 8, 8, 128)    147584      ada_instance_normalization_2[0][0
__________________________________________________________________________________________________
low_pass_filter2d_1 (LowPassFil (None, 8, 8, 128)    0           conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
noise_layer_3 (NoiseLayer)      (None, 8, 8, 128)    128         low_pass_filter2d_1[0][0]        
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 128)          32896       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 128)          32896       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 8, 8, 128)    0           noise_layer_3[0][0]              
__________________________________________________________________________________________________
reshape_6 (Reshape)             (None, 1, 1, 128)    0           dense_11[0][0]                   
__________________________________________________________________________________________________
reshape_5 (Reshape)             (None, 1, 1, 128)    0           dense_10[0][0]                   
__________________________________________________________________________________________________
ada_instance_normalization_3 (A (None, 8, 8, 128)    0           leaky_re_lu_7[0][0]              
                                                                 reshape_6[0][0]                  
                                                                 reshape_5[0][0]                  
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 8, 8, 128)    147584      ada_instance_normalization_3[0][0
__________________________________________________________________________________________________
noise_layer_4 (NoiseLayer)      (None, 8, 8, 128)    128         conv2d_3[0][0]                   
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 128)          32896       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 128)          32896       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 8, 8, 128)    0           noise_layer_4[0][0]              
__________________________________________________________________________________________________
reshape_8 (Reshape)             (None, 1, 1, 128)    0           dense_13[0][0]                   
__________________________________________________________________________________________________
reshape_7 (Reshape)             (None, 1, 1, 128)    0           dense_12[0][0]                   
__________________________________________________________________________________________________
ada_instance_normalization_4 (A (None, 8, 8, 128)    0           leaky_re_lu_8[0][0]              
                                                                 reshape_8[0][0]                  
                                                                 reshape_7[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 16, 16, 128)  147584      ada_instance_normalization_4[0][0
__________________________________________________________________________________________________
low_pass_filter2d_2 (LowPassFil (None, 16, 16, 128)  0           conv2d_transpose_2[0][0]         
__________________________________________________________________________________________________
noise_layer_5 (NoiseLayer)      (None, 16, 16, 128)  128         low_pass_filter2d_2[0][0]        
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 128)          32896       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 128)          32896       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 16, 16, 128)  0           noise_layer_5[0][0]              
__________________________________________________________________________________________________
reshape_10 (Reshape)            (None, 1, 1, 128)    0           dense_15[0][0]                   
__________________________________________________________________________________________________
reshape_9 (Reshape)             (None, 1, 1, 128)    0           dense_14[0][0]                   
__________________________________________________________________________________________________
ada_instance_normalization_5 (A (None, 16, 16, 128)  0           leaky_re_lu_9[0][0]              
                                                                 reshape_10[0][0]                 
                                                                 reshape_9[0][0]                  
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 16, 16, 128)  147584      ada_instance_normalization_5[0][0
__________________________________________________________________________________________________
noise_layer_6 (NoiseLayer)      (None, 16, 16, 128)  128         conv2d_4[0][0]                   
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 128)          32896       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 128)          32896       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 16, 16, 128)  0           noise_layer_6[0][0]              
__________________________________________________________________________________________________
reshape_12 (Reshape)            (None, 1, 1, 128)    0           dense_17[0][0]                   
__________________________________________________________________________________________________
reshape_11 (Reshape)            (None, 1, 1, 128)    0           dense_16[0][0]                   
__________________________________________________________________________________________________
ada_instance_normalization_6 (A (None, 16, 16, 128)  0           leaky_re_lu_10[0][0]             
                                                                 reshape_12[0][0]                 
                                                                 reshape_11[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 32, 32, 128)  147584      ada_instance_normalization_6[0][0
__________________________________________________________________________________________________
low_pass_filter2d_3 (LowPassFil (None, 32, 32, 128)  0           conv2d_transpose_3[0][0]         
__________________________________________________________________________________________________
noise_layer_7 (NoiseLayer)      (None, 32, 32, 128)  128         low_pass_filter2d_3[0][0]        
__________________________________________________________________________________________________
dense_19 (Dense)                (None, 128)          32896       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 128)          32896       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 32, 32, 128)  0           noise_layer_7[0][0]              
__________________________________________________________________________________________________
reshape_14 (Reshape)            (None, 1, 1, 128)    0           dense_19[0][0]                   
__________________________________________________________________________________________________
reshape_13 (Reshape)            (None, 1, 1, 128)    0           dense_18[0][0]                   
__________________________________________________________________________________________________
ada_instance_normalization_7 (A (None, 32, 32, 128)  0           leaky_re_lu_11[0][0]             
                                                                 reshape_14[0][0]                 
                                                                 reshape_13[0][0]                 
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 128)  147584      ada_instance_normalization_7[0][0
__________________________________________________________________________________________________
noise_layer_8 (NoiseLayer)      (None, 32, 32, 128)  128         conv2d_5[0][0]                   
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 128)          32896       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 128)          32896       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 32, 32, 128)  0           noise_layer_8[0][0]              
__________________________________________________________________________________________________
reshape_16 (Reshape)            (None, 1, 1, 128)    0           dense_21[0][0]                   
__________________________________________________________________________________________________
reshape_15 (Reshape)            (None, 1, 1, 128)    0           dense_20[0][0]                   
__________________________________________________________________________________________________
ada_instance_normalization_8 (A (None, 32, 32, 128)  0           leaky_re_lu_12[0][0]             
                                                                 reshape_16[0][0]                 
                                                                 reshape_15[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 64, 64, 64)   73792       ada_instance_normalization_8[0][0
__________________________________________________________________________________________________
low_pass_filter2d_4 (LowPassFil (None, 64, 64, 64)   0           conv2d_transpose_4[0][0]         
__________________________________________________________________________________________________
noise_layer_9 (NoiseLayer)      (None, 64, 64, 64)   64          low_pass_filter2d_4[0][0]        
__________________________________________________________________________________________________
dense_23 (Dense)                (None, 64)           16448       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense_22 (Dense)                (None, 64)           16448       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 64, 64, 64)   0           noise_layer_9[0][0]              
__________________________________________________________________________________________________
reshape_18 (Reshape)            (None, 1, 1, 64)     0           dense_23[0][0]                   
__________________________________________________________________________________________________
reshape_17 (Reshape)            (None, 1, 1, 64)     0           dense_22[0][0]                   
__________________________________________________________________________________________________
ada_instance_normalization_9 (A (None, 64, 64, 64)   0           leaky_re_lu_13[0][0]             
                                                                 reshape_18[0][0]                 
                                                                 reshape_17[0][0]                 
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 64, 64, 64)   36928       ada_instance_normalization_9[0][0
__________________________________________________________________________________________________
noise_layer_10 (NoiseLayer)     (None, 64, 64, 64)   64          conv2d_6[0][0]                   
__________________________________________________________________________________________________
dense_25 (Dense)                (None, 64)           16448       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense_24 (Dense)                (None, 64)           16448       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 64, 64, 64)   0           noise_layer_10[0][0]             
__________________________________________________________________________________________________
reshape_20 (Reshape)            (None, 1, 1, 64)     0           dense_25[0][0]                   
__________________________________________________________________________________________________
reshape_19 (Reshape)            (None, 1, 1, 64)     0           dense_24[0][0]                   
__________________________________________________________________________________________________
ada_instance_normalization_10 ( (None, 64, 64, 64)   0           leaky_re_lu_14[0][0]             
                                                                 reshape_20[0][0]                 
                                                                 reshape_19[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 128, 128, 32) 18464       ada_instance_normalization_10[0][
__________________________________________________________________________________________________
low_pass_filter2d_5 (LowPassFil (None, 128, 128, 32) 0           conv2d_transpose_5[0][0]         
__________________________________________________________________________________________________
noise_layer_11 (NoiseLayer)     (None, 128, 128, 32) 32          low_pass_filter2d_5[0][0]        
__________________________________________________________________________________________________
dense_27 (Dense)                (None, 32)           8224        leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense_26 (Dense)                (None, 32)           8224        leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 128, 128, 32) 0           noise_layer_11[0][0]             
__________________________________________________________________________________________________
reshape_22 (Reshape)            (None, 1, 1, 32)     0           dense_27[0][0]                   
__________________________________________________________________________________________________
reshape_21 (Reshape)            (None, 1, 1, 32)     0           dense_26[0][0]                   
__________________________________________________________________________________________________
ada_instance_normalization_11 ( (None, 128, 128, 32) 0           leaky_re_lu_15[0][0]             
                                                                 reshape_22[0][0]                 
                                                                 reshape_21[0][0]                 
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 128, 128, 32) 9248        ada_instance_normalization_11[0][
__________________________________________________________________________________________________
noise_layer_12 (NoiseLayer)     (None, 128, 128, 32) 32          conv2d_7[0][0]                   
__________________________________________________________________________________________________
dense_29 (Dense)                (None, 32)           8224        leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense_28 (Dense)                (None, 32)           8224        leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 128, 128, 32) 0           noise_layer_12[0][0]             
__________________________________________________________________________________________________
reshape_24 (Reshape)            (None, 1, 1, 32)     0           dense_29[0][0]                   
__________________________________________________________________________________________________
reshape_23 (Reshape)            (None, 1, 1, 32)     0           dense_28[0][0]                   
__________________________________________________________________________________________________
ada_instance_normalization_12 ( (None, 128, 128, 32) 0           leaky_re_lu_16[0][0]             
                                                                 reshape_24[0][0]                 
                                                                 reshape_23[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose_6 (Conv2DTrans (None, 256, 256, 16) 4624        ada_instance_normalization_12[0][
__________________________________________________________________________________________________
low_pass_filter2d_6 (LowPassFil (None, 256, 256, 16) 0           conv2d_transpose_6[0][0]         
__________________________________________________________________________________________________
noise_layer_13 (NoiseLayer)     (None, 256, 256, 16) 16          low_pass_filter2d_6[0][0]        
__________________________________________________________________________________________________
dense_31 (Dense)                (None, 16)           4112        leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense_30 (Dense)                (None, 16)           4112        leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 256, 256, 16) 0           noise_layer_13[0][0]             
__________________________________________________________________________________________________
reshape_26 (Reshape)            (None, 1, 1, 16)     0           dense_31[0][0]                   
__________________________________________________________________________________________________
reshape_25 (Reshape)            (None, 1, 1, 16)     0           dense_30[0][0]                   
__________________________________________________________________________________________________
ada_instance_normalization_13 ( (None, 256, 256, 16) 0           leaky_re_lu_17[0][0]             
                                                                 reshape_26[0][0]                 
                                                                 reshape_25[0][0]                 
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 256, 256, 16) 2320        ada_instance_normalization_13[0][
__________________________________________________________________________________________________
noise_layer_14 (NoiseLayer)     (None, 256, 256, 16) 16          conv2d_8[0][0]                   
__________________________________________________________________________________________________
dense_33 (Dense)                (None, 16)           4112        leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense_32 (Dense)                (None, 16)           4112        leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 256, 256, 16) 0           noise_layer_14[0][0]             
__________________________________________________________________________________________________
reshape_28 (Reshape)            (None, 1, 1, 16)     0           dense_33[0][0]                   
__________________________________________________________________________________________________
reshape_27 (Reshape)            (None, 1, 1, 16)     0           dense_32[0][0]                   
__________________________________________________________________________________________________
ada_instance_normalization_14 ( (None, 256, 256, 16) 0           leaky_re_lu_18[0][0]             
                                                                 reshape_28[0][0]                 
                                                                 reshape_27[0][0]                 
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 256, 256, 3)  51          ada_instance_normalization_14[0][
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 256, 256, 3)  0           conv2d_9[0][0]                   
==================================================================================================
Total params: 2,380,753
Trainable params: 2,380,753
Non-trainable params: 0
__________________________________________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            (None, 256, 256, 3)  0                                            
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 256, 256, 16) 64          input_4[0][0]                    
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 256, 256, 16) 0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 256, 256, 16) 2320        leaky_re_lu_19[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 256, 256, 16) 0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 256, 256, 32) 4640        leaky_re_lu_20[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 256, 256, 32) 0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
low_pass_filter2d_7 (LowPassFil (None, 256, 256, 32) 0           leaky_re_lu_21[0][0]             
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 128, 128, 32) 9248        low_pass_filter2d_7[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (None, 128, 128, 32) 0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 128, 128, 64) 18496       leaky_re_lu_22[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)      (None, 128, 128, 64) 0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
low_pass_filter2d_8 (LowPassFil (None, 128, 128, 64) 0           leaky_re_lu_23[0][0]             
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 64, 64, 64)   36928       low_pass_filter2d_8[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_24 (LeakyReLU)      (None, 64, 64, 64)   0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 64, 64, 128)  73856       leaky_re_lu_24[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_25 (LeakyReLU)      (None, 64, 64, 128)  0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
low_pass_filter2d_9 (LowPassFil (None, 64, 64, 128)  0           leaky_re_lu_25[0][0]             
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 32, 32, 128)  147584      low_pass_filter2d_9[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_26 (LeakyReLU)      (None, 32, 32, 128)  0           conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 32, 32, 128)  147584      leaky_re_lu_26[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_27 (LeakyReLU)      (None, 32, 32, 128)  0           conv2d_18[0][0]                  
__________________________________________________________________________________________________
low_pass_filter2d_10 (LowPassFi (None, 32, 32, 128)  0           leaky_re_lu_27[0][0]             
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 16, 16, 128)  147584      low_pass_filter2d_10[0][0]       
__________________________________________________________________________________________________
leaky_re_lu_28 (LeakyReLU)      (None, 16, 16, 128)  0           conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 16, 16, 128)  147584      leaky_re_lu_28[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_29 (LeakyReLU)      (None, 16, 16, 128)  0           conv2d_20[0][0]                  
__________________________________________________________________________________________________
low_pass_filter2d_11 (LowPassFi (None, 16, 16, 128)  0           leaky_re_lu_29[0][0]             
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 8, 8, 128)    147584      low_pass_filter2d_11[0][0]       
__________________________________________________________________________________________________
leaky_re_lu_30 (LeakyReLU)      (None, 8, 8, 128)    0           conv2d_21[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 8, 8, 128)    147584      leaky_re_lu_30[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_31 (LeakyReLU)      (None, 8, 8, 128)    0           conv2d_22[0][0]                  
__________________________________________________________________________________________________
low_pass_filter2d_12 (LowPassFi (None, 8, 8, 128)    0           leaky_re_lu_31[0][0]             
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 4, 4, 128)    147584      low_pass_filter2d_12[0][0]       
__________________________________________________________________________________________________
leaky_re_lu_32 (LeakyReLU)      (None, 4, 4, 128)    0           conv2d_23[0][0]                  
__________________________________________________________________________________________________
mini_batch_std_1 (MiniBatchStd) (None, 4, 4, 129)    0           leaky_re_lu_32[0][0]             
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 2, 2, 128)    148736      mini_batch_std_1[0][0]           
__________________________________________________________________________________________________
leaky_re_lu_33 (LeakyReLU)      (None, 2, 2, 128)    0           conv2d_24[0][0]                  
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 512)          0           leaky_re_lu_33[0][0]             
__________________________________________________________________________________________________
input_5 (InputLayer)            (None, 5)            0                                            
__________________________________________________________________________________________________
dense_34 (Dense)                (None, 128)          65664       flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_36 (Dense)                (None, 1)            6           input_5[0][0]                    
__________________________________________________________________________________________________
leaky_re_lu_34 (LeakyReLU)      (None, 128)          0           dense_34[0][0]                   
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 128)          0           dense_36[0][0]                   
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 128)          0           lambda_1[0][0]                   
                                                                 leaky_re_lu_34[0][0]             
__________________________________________________________________________________________________
dense_35 (Dense)                (None, 1)            129         leaky_re_lu_34[0][0]             
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 1)            0           multiply_1[0][0]                 
__________________________________________________________________________________________________
add_1 (Add)                     (None, 1)            0           dense_35[0][0]                   
                                                                 lambda_2[0][0]                   
==================================================================================================
Total params: 1,393,175
Trainable params: 1,393,175
Non-trainable params: 0
__________________________________________________________________________________________________
