__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 256)          0                                            
__________________________________________________________________________________________________
learned_constant_latent_1 (Lear (None, 256)          256         input_3[0][0]                    
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 261)          0                                            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 2048)         526336      learned_constant_latent_1[0][0]  
__________________________________________________________________________________________________
equalized_dense_1 (EqualizedDen (None, 256)          67072       input_1[0][0]                    
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 4, 4, 128)    0           dense_1[0][0]                    
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 256)          0           equalized_dense_1[0][0]          
__________________________________________________________________________________________________
equalized_conv2d_1 (EqualizedCo (None, 4, 4, 128)    262272      reshape_1[0][0]                  
__________________________________________________________________________________________________
equalized_dense_2 (EqualizedDen (None, 256)          65792       leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 4, 4, 128)    0           equalized_conv2d_1[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 256)          0           equalized_dense_2[0][0]          
__________________________________________________________________________________________________
equalized_conv2d_transpose_1 (E (None, 8, 8, 128)    147584      leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 128)          32896       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 128)          32896       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 256, 256, 1)  0                                            
__________________________________________________________________________________________________
low_pass_filter2d_1 (LowPassFil (None, 8, 8, 128)    0           equalized_conv2d_transpose_1[0][0
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 1, 1, 128)    0           dense_3[0][0]                    
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 1, 1, 128)    0           dense_2[0][0]                    
__________________________________________________________________________________________________
cropping2d_1 (Cropping2D)       (None, 8, 8, 1)      0           input_2[0][0]                    
__________________________________________________________________________________________________
ada_instance_normalization_1 (A (None, 8, 8, 128)    0           low_pass_filter2d_1[0][0]        
                                                                 reshape_3[0][0]                  
                                                                 reshape_2[0][0]                  
__________________________________________________________________________________________________
equalized_conv2d_2 (EqualizedCo (None, 8, 8, 128)    256         cropping2d_1[0][0]               
__________________________________________________________________________________________________
add_1 (Add)                     (None, 8, 8, 128)    0           ada_instance_normalization_1[0][0
                                                                 equalized_conv2d_2[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 8, 8, 128)    0           add_1[0][0]                      
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 128)          32896       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 128)          32896       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
equalized_conv2d_3 (EqualizedCo (None, 8, 8, 128)    147584      leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
reshape_5 (Reshape)             (None, 1, 1, 128)    0           dense_5[0][0]                    
__________________________________________________________________________________________________
reshape_4 (Reshape)             (None, 1, 1, 128)    0           dense_4[0][0]                    
__________________________________________________________________________________________________
cropping2d_2 (Cropping2D)       (None, 8, 8, 1)      0           input_2[0][0]                    
__________________________________________________________________________________________________
ada_instance_normalization_2 (A (None, 8, 8, 128)    0           equalized_conv2d_3[0][0]         
                                                                 reshape_5[0][0]                  
                                                                 reshape_4[0][0]                  
__________________________________________________________________________________________________
equalized_conv2d_4 (EqualizedCo (None, 8, 8, 128)    256         cropping2d_2[0][0]               
__________________________________________________________________________________________________
add_2 (Add)                     (None, 8, 8, 128)    0           ada_instance_normalization_2[0][0
                                                                 equalized_conv2d_4[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 8, 8, 128)    0           add_2[0][0]                      
__________________________________________________________________________________________________
equalized_conv2d_transpose_2 (E (None, 16, 16, 128)  147584      leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 128)          32896       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 128)          32896       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
low_pass_filter2d_2 (LowPassFil (None, 16, 16, 128)  0           equalized_conv2d_transpose_2[0][0
__________________________________________________________________________________________________
reshape_7 (Reshape)             (None, 1, 1, 128)    0           dense_7[0][0]                    
__________________________________________________________________________________________________
reshape_6 (Reshape)             (None, 1, 1, 128)    0           dense_6[0][0]                    
__________________________________________________________________________________________________
cropping2d_3 (Cropping2D)       (None, 16, 16, 1)    0           input_2[0][0]                    
__________________________________________________________________________________________________
ada_instance_normalization_3 (A (None, 16, 16, 128)  0           low_pass_filter2d_2[0][0]        
                                                                 reshape_7[0][0]                  
                                                                 reshape_6[0][0]                  
__________________________________________________________________________________________________
equalized_conv2d_5 (EqualizedCo (None, 16, 16, 128)  256         cropping2d_3[0][0]               
__________________________________________________________________________________________________
add_3 (Add)                     (None, 16, 16, 128)  0           ada_instance_normalization_3[0][0
                                                                 equalized_conv2d_5[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 16, 16, 128)  0           add_3[0][0]                      
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 128)          32896       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 128)          32896       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
equalized_conv2d_6 (EqualizedCo (None, 16, 16, 128)  147584      leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
reshape_9 (Reshape)             (None, 1, 1, 128)    0           dense_9[0][0]                    
__________________________________________________________________________________________________
reshape_8 (Reshape)             (None, 1, 1, 128)    0           dense_8[0][0]                    
__________________________________________________________________________________________________
cropping2d_4 (Cropping2D)       (None, 16, 16, 1)    0           input_2[0][0]                    
__________________________________________________________________________________________________
ada_instance_normalization_4 (A (None, 16, 16, 128)  0           equalized_conv2d_6[0][0]         
                                                                 reshape_9[0][0]                  
                                                                 reshape_8[0][0]                  
__________________________________________________________________________________________________
equalized_conv2d_7 (EqualizedCo (None, 16, 16, 128)  256         cropping2d_4[0][0]               
__________________________________________________________________________________________________
add_4 (Add)                     (None, 16, 16, 128)  0           ada_instance_normalization_4[0][0
                                                                 equalized_conv2d_7[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 16, 16, 128)  0           add_4[0][0]                      
__________________________________________________________________________________________________
equalized_conv2d_transpose_3 (E (None, 32, 32, 128)  147584      leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 128)          32896       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 128)          32896       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
low_pass_filter2d_3 (LowPassFil (None, 32, 32, 128)  0           equalized_conv2d_transpose_3[0][0
__________________________________________________________________________________________________
reshape_11 (Reshape)            (None, 1, 1, 128)    0           dense_11[0][0]                   
__________________________________________________________________________________________________
reshape_10 (Reshape)            (None, 1, 1, 128)    0           dense_10[0][0]                   
__________________________________________________________________________________________________
cropping2d_5 (Cropping2D)       (None, 32, 32, 1)    0           input_2[0][0]                    
__________________________________________________________________________________________________
ada_instance_normalization_5 (A (None, 32, 32, 128)  0           low_pass_filter2d_3[0][0]        
                                                                 reshape_11[0][0]                 
                                                                 reshape_10[0][0]                 
__________________________________________________________________________________________________
equalized_conv2d_8 (EqualizedCo (None, 32, 32, 128)  256         cropping2d_5[0][0]               
__________________________________________________________________________________________________
add_5 (Add)                     (None, 32, 32, 128)  0           ada_instance_normalization_5[0][0
                                                                 equalized_conv2d_8[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 32, 32, 128)  0           add_5[0][0]                      
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 128)          32896       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 128)          32896       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
equalized_conv2d_9 (EqualizedCo (None, 32, 32, 128)  147584      leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
reshape_13 (Reshape)            (None, 1, 1, 128)    0           dense_13[0][0]                   
__________________________________________________________________________________________________
reshape_12 (Reshape)            (None, 1, 1, 128)    0           dense_12[0][0]                   
__________________________________________________________________________________________________
cropping2d_6 (Cropping2D)       (None, 32, 32, 1)    0           input_2[0][0]                    
__________________________________________________________________________________________________
ada_instance_normalization_6 (A (None, 32, 32, 128)  0           equalized_conv2d_9[0][0]         
                                                                 reshape_13[0][0]                 
                                                                 reshape_12[0][0]                 
__________________________________________________________________________________________________
equalized_conv2d_10 (EqualizedC (None, 32, 32, 128)  256         cropping2d_6[0][0]               
__________________________________________________________________________________________________
add_6 (Add)                     (None, 32, 32, 128)  0           ada_instance_normalization_6[0][0
                                                                 equalized_conv2d_10[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 32, 32, 128)  0           add_6[0][0]                      
__________________________________________________________________________________________________
equalized_conv2d_transpose_4 (E (None, 64, 64, 64)   73792       leaky_re_lu_9[0][0]              
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 64)           16448       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 64)           16448       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
low_pass_filter2d_4 (LowPassFil (None, 64, 64, 64)   0           equalized_conv2d_transpose_4[0][0
__________________________________________________________________________________________________
reshape_15 (Reshape)            (None, 1, 1, 64)     0           dense_15[0][0]                   
__________________________________________________________________________________________________
reshape_14 (Reshape)            (None, 1, 1, 64)     0           dense_14[0][0]                   
__________________________________________________________________________________________________
cropping2d_7 (Cropping2D)       (None, 64, 64, 1)    0           input_2[0][0]                    
__________________________________________________________________________________________________
ada_instance_normalization_7 (A (None, 64, 64, 64)   0           low_pass_filter2d_4[0][0]        
                                                                 reshape_15[0][0]                 
                                                                 reshape_14[0][0]                 
__________________________________________________________________________________________________
equalized_conv2d_11 (EqualizedC (None, 64, 64, 64)   128         cropping2d_7[0][0]               
__________________________________________________________________________________________________
add_7 (Add)                     (None, 64, 64, 64)   0           ada_instance_normalization_7[0][0
                                                                 equalized_conv2d_11[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 64, 64, 64)   0           add_7[0][0]                      
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 64)           16448       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 64)           16448       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
equalized_conv2d_12 (EqualizedC (None, 64, 64, 64)   36928       leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
reshape_17 (Reshape)            (None, 1, 1, 64)     0           dense_17[0][0]                   
__________________________________________________________________________________________________
reshape_16 (Reshape)            (None, 1, 1, 64)     0           dense_16[0][0]                   
__________________________________________________________________________________________________
cropping2d_8 (Cropping2D)       (None, 64, 64, 1)    0           input_2[0][0]                    
__________________________________________________________________________________________________
ada_instance_normalization_8 (A (None, 64, 64, 64)   0           equalized_conv2d_12[0][0]        
                                                                 reshape_17[0][0]                 
                                                                 reshape_16[0][0]                 
__________________________________________________________________________________________________
equalized_conv2d_13 (EqualizedC (None, 64, 64, 64)   128         cropping2d_8[0][0]               
__________________________________________________________________________________________________
add_8 (Add)                     (None, 64, 64, 64)   0           ada_instance_normalization_8[0][0
                                                                 equalized_conv2d_13[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 64, 64, 64)   0           add_8[0][0]                      
__________________________________________________________________________________________________
equalized_conv2d_transpose_5 (E (None, 128, 128, 32) 18464       leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
dense_19 (Dense)                (None, 32)           8224        leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 32)           8224        leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
low_pass_filter2d_5 (LowPassFil (None, 128, 128, 32) 0           equalized_conv2d_transpose_5[0][0
__________________________________________________________________________________________________
reshape_19 (Reshape)            (None, 1, 1, 32)     0           dense_19[0][0]                   
__________________________________________________________________________________________________
reshape_18 (Reshape)            (None, 1, 1, 32)     0           dense_18[0][0]                   
__________________________________________________________________________________________________
cropping2d_9 (Cropping2D)       (None, 128, 128, 1)  0           input_2[0][0]                    
__________________________________________________________________________________________________
ada_instance_normalization_9 (A (None, 128, 128, 32) 0           low_pass_filter2d_5[0][0]        
                                                                 reshape_19[0][0]                 
                                                                 reshape_18[0][0]                 
__________________________________________________________________________________________________
equalized_conv2d_14 (EqualizedC (None, 128, 128, 32) 64          cropping2d_9[0][0]               
__________________________________________________________________________________________________
add_9 (Add)                     (None, 128, 128, 32) 0           ada_instance_normalization_9[0][0
                                                                 equalized_conv2d_14[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 128, 128, 32) 0           add_9[0][0]                      
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 32)           8224        leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 32)           8224        leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
equalized_conv2d_15 (EqualizedC (None, 128, 128, 32) 9248        leaky_re_lu_12[0][0]             
__________________________________________________________________________________________________
reshape_21 (Reshape)            (None, 1, 1, 32)     0           dense_21[0][0]                   
__________________________________________________________________________________________________
reshape_20 (Reshape)            (None, 1, 1, 32)     0           dense_20[0][0]                   
__________________________________________________________________________________________________
cropping2d_10 (Cropping2D)      (None, 128, 128, 1)  0           input_2[0][0]                    
__________________________________________________________________________________________________
ada_instance_normalization_10 ( (None, 128, 128, 32) 0           equalized_conv2d_15[0][0]        
                                                                 reshape_21[0][0]                 
                                                                 reshape_20[0][0]                 
__________________________________________________________________________________________________
equalized_conv2d_16 (EqualizedC (None, 128, 128, 32) 64          cropping2d_10[0][0]              
__________________________________________________________________________________________________
add_10 (Add)                    (None, 128, 128, 32) 0           ada_instance_normalization_10[0][
                                                                 equalized_conv2d_16[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 128, 128, 32) 0           add_10[0][0]                     
__________________________________________________________________________________________________
equalized_conv2d_transpose_6 (E (None, 256, 256, 16) 4624        leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
dense_23 (Dense)                (None, 16)           4112        leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
dense_22 (Dense)                (None, 16)           4112        leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
low_pass_filter2d_6 (LowPassFil (None, 256, 256, 16) 0           equalized_conv2d_transpose_6[0][0
__________________________________________________________________________________________________
reshape_23 (Reshape)            (None, 1, 1, 16)     0           dense_23[0][0]                   
__________________________________________________________________________________________________
reshape_22 (Reshape)            (None, 1, 1, 16)     0           dense_22[0][0]                   
__________________________________________________________________________________________________
cropping2d_11 (Cropping2D)      (None, 256, 256, 1)  0           input_2[0][0]                    
__________________________________________________________________________________________________
ada_instance_normalization_11 ( (None, 256, 256, 16) 0           low_pass_filter2d_6[0][0]        
                                                                 reshape_23[0][0]                 
                                                                 reshape_22[0][0]                 
__________________________________________________________________________________________________
equalized_conv2d_17 (EqualizedC (None, 256, 256, 16) 32          cropping2d_11[0][0]              
__________________________________________________________________________________________________
add_11 (Add)                    (None, 256, 256, 16) 0           ada_instance_normalization_11[0][
                                                                 equalized_conv2d_17[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 256, 256, 16) 0           add_11[0][0]                     
__________________________________________________________________________________________________
dense_25 (Dense)                (None, 16)           4112        leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
dense_24 (Dense)                (None, 16)           4112        leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
equalized_conv2d_18 (EqualizedC (None, 256, 256, 16) 2320        leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
reshape_25 (Reshape)            (None, 1, 1, 16)     0           dense_25[0][0]                   
__________________________________________________________________________________________________
reshape_24 (Reshape)            (None, 1, 1, 16)     0           dense_24[0][0]                   
__________________________________________________________________________________________________
cropping2d_12 (Cropping2D)      (None, 256, 256, 1)  0           input_2[0][0]                    
__________________________________________________________________________________________________
ada_instance_normalization_12 ( (None, 256, 256, 16) 0           equalized_conv2d_18[0][0]        
                                                                 reshape_25[0][0]                 
                                                                 reshape_24[0][0]                 
__________________________________________________________________________________________________
equalized_conv2d_19 (EqualizedC (None, 256, 256, 16) 32          cropping2d_12[0][0]              
__________________________________________________________________________________________________
add_12 (Add)                    (None, 256, 256, 16) 0           ada_instance_normalization_12[0][
                                                                 equalized_conv2d_19[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 256, 256, 16) 0           add_12[0][0]                     
__________________________________________________________________________________________________
equalized_conv2d_20 (EqualizedC (None, 256, 256, 3)  51          leaky_re_lu_15[0][0]             
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 256, 256, 3)  0           equalized_conv2d_20[0][0]        
==================================================================================================
Total params: 2,464,531
Trainable params: 2,464,531
Non-trainable params: 0
__________________________________________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            (None, 256, 256, 3)  0                                            
__________________________________________________________________________________________________
equalized_conv2d_21 (EqualizedC (None, 256, 256, 16) 64          input_4[0][0]                    
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 256, 256, 16) 0           equalized_conv2d_21[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_22 (EqualizedC (None, 256, 256, 16) 2320        leaky_re_lu_16[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 256, 256, 16) 0           equalized_conv2d_22[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_23 (EqualizedC (None, 256, 256, 32) 4640        leaky_re_lu_17[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 256, 256, 32) 0           equalized_conv2d_23[0][0]        
__________________________________________________________________________________________________
low_pass_filter2d_7 (LowPassFil (None, 256, 256, 32) 0           leaky_re_lu_18[0][0]             
__________________________________________________________________________________________________
equalized_conv2d_24 (EqualizedC (None, 128, 128, 32) 9248        low_pass_filter2d_7[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 128, 128, 32) 0           equalized_conv2d_24[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_25 (EqualizedC (None, 128, 128, 64) 18496       leaky_re_lu_19[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 128, 128, 64) 0           equalized_conv2d_25[0][0]        
__________________________________________________________________________________________________
low_pass_filter2d_8 (LowPassFil (None, 128, 128, 64) 0           leaky_re_lu_20[0][0]             
__________________________________________________________________________________________________
equalized_conv2d_26 (EqualizedC (None, 64, 64, 64)   36928       low_pass_filter2d_8[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 64, 64, 64)   0           equalized_conv2d_26[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_27 (EqualizedC (None, 64, 64, 128)  73856       leaky_re_lu_21[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (None, 64, 64, 128)  0           equalized_conv2d_27[0][0]        
__________________________________________________________________________________________________
low_pass_filter2d_9 (LowPassFil (None, 64, 64, 128)  0           leaky_re_lu_22[0][0]             
__________________________________________________________________________________________________
equalized_conv2d_28 (EqualizedC (None, 32, 32, 128)  147584      low_pass_filter2d_9[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)      (None, 32, 32, 128)  0           equalized_conv2d_28[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_29 (EqualizedC (None, 32, 32, 128)  147584      leaky_re_lu_23[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_24 (LeakyReLU)      (None, 32, 32, 128)  0           equalized_conv2d_29[0][0]        
__________________________________________________________________________________________________
low_pass_filter2d_10 (LowPassFi (None, 32, 32, 128)  0           leaky_re_lu_24[0][0]             
__________________________________________________________________________________________________
equalized_conv2d_30 (EqualizedC (None, 16, 16, 128)  147584      low_pass_filter2d_10[0][0]       
__________________________________________________________________________________________________
leaky_re_lu_25 (LeakyReLU)      (None, 16, 16, 128)  0           equalized_conv2d_30[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_31 (EqualizedC (None, 16, 16, 128)  147584      leaky_re_lu_25[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_26 (LeakyReLU)      (None, 16, 16, 128)  0           equalized_conv2d_31[0][0]        
__________________________________________________________________________________________________
low_pass_filter2d_11 (LowPassFi (None, 16, 16, 128)  0           leaky_re_lu_26[0][0]             
__________________________________________________________________________________________________
equalized_conv2d_32 (EqualizedC (None, 8, 8, 128)    147584      low_pass_filter2d_11[0][0]       
__________________________________________________________________________________________________
leaky_re_lu_27 (LeakyReLU)      (None, 8, 8, 128)    0           equalized_conv2d_32[0][0]        
__________________________________________________________________________________________________
equalized_conv2d_33 (EqualizedC (None, 8, 8, 128)    147584      leaky_re_lu_27[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_28 (LeakyReLU)      (None, 8, 8, 128)    0           equalized_conv2d_33[0][0]        
__________________________________________________________________________________________________
low_pass_filter2d_12 (LowPassFi (None, 8, 8, 128)    0           leaky_re_lu_28[0][0]             
__________________________________________________________________________________________________
equalized_conv2d_34 (EqualizedC (None, 4, 4, 128)    147584      low_pass_filter2d_12[0][0]       
__________________________________________________________________________________________________
leaky_re_lu_29 (LeakyReLU)      (None, 4, 4, 128)    0           equalized_conv2d_34[0][0]        
__________________________________________________________________________________________________
mini_batch_std_1 (MiniBatchStd) (None, 4, 4, 129)    0           leaky_re_lu_29[0][0]             
__________________________________________________________________________________________________
equalized_conv2d_35 (EqualizedC (None, 2, 2, 128)    148736      mini_batch_std_1[0][0]           
__________________________________________________________________________________________________
leaky_re_lu_30 (LeakyReLU)      (None, 2, 2, 128)    0           equalized_conv2d_35[0][0]        
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 512)          0           leaky_re_lu_30[0][0]             
__________________________________________________________________________________________________
input_5 (InputLayer)            (None, 5)            0                                            
__________________________________________________________________________________________________
equalized_dense_3 (EqualizedDen (None, 128)          65664       flatten_1[0][0]                  
__________________________________________________________________________________________________
equalized_dense_5 (EqualizedDen (None, 1)            6           input_5[0][0]                    
__________________________________________________________________________________________________
leaky_re_lu_31 (LeakyReLU)      (None, 128)          0           equalized_dense_3[0][0]          
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 128)          0           equalized_dense_5[0][0]          
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 128)          0           lambda_1[0][0]                   
                                                                 leaky_re_lu_31[0][0]             
__________________________________________________________________________________________________
equalized_dense_4 (EqualizedDen (None, 1)            129         leaky_re_lu_31[0][0]             
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 1)            0           multiply_1[0][0]                 
__________________________________________________________________________________________________
add_13 (Add)                    (None, 1)            0           equalized_dense_4[0][0]          
                                                                 lambda_2[0][0]                   
==================================================================================================
Total params: 1,393,175
Trainable params: 1,393,175
Non-trainable params: 0
__________________________________________________________________________________________________
